

#ifndef	CTC_CFGDATASACE_H
#define	CTC_CFGDATASACE_H

#ifndef GW_EPON_SYS_H
#include	"gwEponSys.h"
#endif

#include "cli/cli.h"

typedef	ULONG (*FUNCPTR_CFGDATA)( const ULONG, const ULONG );

void	initOperateFunctions( void );

/*******************************************************************************************
函数名：saveCtcCfgData
功能：	保存CTC的ONU配置数据
输入：	无
返回值：无
*******************************************************************************************/
void	saveCtcCfgData( void );


/*******************************************************************************************
函数名：saveCtcOneOnuCfgData
功能：	将指定的ONU的配置数据存储到指定地址
输入：	addr,指定的内在地址;devIdx,指定的ONU设备地址
返回值：存储的字节数
*******************************************************************************************/
ULONG saveCtcOneOnuCfgData( ULONG addr, ULONG devIdx );


/*******************************************************************************************
函数名：retrieveCtcCfgData
功能：	恢复配置数据
输入：	无
返回值：无
*******************************************************************************************/
void retrieveCtcCfgData( void );


/*******************************************************************************************
函数名：retrieveCtcOneOnuAction
功能：	将指定ONU的配置数据写到ONU上
输入：	devIdx,指定的ONU设备索引
返回值：0,正常；1，错误
*******************************************************************************************/
int	retrieveCtcOneOnuAction( const ULONG devIdx );


/*******************************************************************************************
函数名：retrieveCtcOneOnuCfgData
功能：	从指定的地址恢复ONU的配置数据
输入：	addr,指定的内存地址；newDev＝0时，按存储内容中的设备地址恢复，
		newDev != 0, 将存储内容恢复到newDev指定的ONU
返回值：处理数据的字节数
*******************************************************************************************/
ULONG retrieveCtcOneOnuCfgData( ULONG addr, ULONG newDev );


/*******************************************************************************************
函数名：deleteCtcRunningCfgData
功能：	将指定的ONU的当前配置数据恢复成默认值
输入：	devIdx,指定的ONU设备索引
返回值：无
*******************************************************************************************/
void	deleteCtcRunningCfgData( const ULONG devIdx );


/*******************************************************************************************
函数名：parseDevidxFromOnuEntry
功能：	将ONU的编号转换为设备索引
输入：	ONU编号，0-MAXONU(20*64)
返回值：设备索引
*******************************************************************************************/
ULONG parseDevidxFromOnuEntry( const int );


/*******************************************************************************************
函数名：parseDevidxFromPonOnu
功能：	用PON端口索引和PON上的ONU编号生成ONU的设备索引
输入：	PON端口索引，0-19;PON端口上ONU编号，0－63
返回值：设备索引
*******************************************************************************************/
ULONG parseDevidxFromPonOnu( const short int , const short int );


/*******************************************************************************************
函数名：parseOnuIndexFromDevIdx
功能：	由ONU设备索引生成对应的ONU编号、PON端口索引及PON上ONU编号
输入：	设备索引；
输出：	PON端口索引，0-19
		PON上ONU编号，0-63
		两个输入值如果同时为NULL，则只返回ONU编号
返回值：ONU编号, 0~20*64-1
*******************************************************************************************/
short int parseOnuIndexFromDevIdx( const ULONG, ULONG *, ULONG * );


/*******************************************************************************************
函数名：ponSwitchCtcOnuCfgData
功能：	完成PON端口保护切换中配置数据的切换
输入：	srcPon,切换中的源端口(0-19);desPon,切换中的目的端口(0-19)
返回值：无
*******************************************************************************************/
void ponSwitchCtcOnuCfgData( const short int srcPon, const short int desPon );


/*******************************************************************************************
函数名：printCtcCfgData
功能：	打印CTC配置数据
输入：	vty,打印的输出终端
输出：	无
返回值：无
*******************************************************************************************/
void printCtcCfgData( struct vty * vty , uchar *addr );

#endif

